In [1]:
! pip install -q openai

     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 73.6/73.6 kB 5.0 MB/s eta 0:00:00

In [2]:
import openai
from google.colab import files
import io
import pandas as pd

In [3]:
uploaded = files.upload()

Saving cleaned_response.csv to cleaned_response.csv

In [4]:
data = pd.read_csv(io.BytesIO(uploaded['cleaned_response.csv']))
data = data.drop(columns='Unnamed: 0')
data.head()

,BSpace Course Name,BSpace Course Id,QuizName,﻿QuizId,QuizAttemptNumber,QuestionId,Question,QuestionType,InputUserAnswer,Score,NetId,Comment left on User Response,AnswerKey,isQuery,Database,full_score,feedback
0,"Databases for Business Analytics, Winter 2023","251,683",Final Exam,"283,453",1,"4,969,729",Hard question. Requires use of subqueries and ...,Long Answer Question,"SELECT \n A.CustomerID,\n A.CompanyName,...",10.0,ab3864,Results for identical to the answer key becaus...,"WITH total_spent AS (\nSELECT C.CustomerID, C....",True,"['northwind', 'flights']",10.0,The feedback from the TA was Results for ident...
1,"Databases for Business Analytics, Winter 2023","251,683",Final Exam,"283,453",1,"4,969,713","For each order, show the customerID who placed...",Long Answer Question,"Select O.OrderID, O.CustomerID, Count(D.Produ...",5.5,ab3864,-3 pts for lack for HAVING\n-1 pts for using t...,"SELECT O.OrderID, O.CustomerID\n&#160; &#160; ...",True,"['northwind', 'flights']",10.0,The feedback from the TA was -3 pts for lack f...
2,"Databases for Business Analytics, Winter 2023","251,683",Final Exam,"283,453",1,"4,969,711",We want to identify the ship countries with th...,Long Answer Question,"use northwind;\nSELECT \n ShipCountry, AVG(...",7.0,ab3864,"It is ""LIMIT 3"" not ""LIMIT = 3""","SELECT ShipCountry, ROUND(AVG(Freight),2) AS A...",True,"['northwind', 'flights']",7.5,"The feedback from the TA was It is ""LIMIT 3"" n..."
3,"Databases for Business Analytics, Winter 2023","251,683",Final Exam,"283,453",1,"4,969,710",For every customer in the database list the nu...,Long Answer Question,"Select C.CompanyName, C.CustomerID, sum(case w...",10.0,ab3864,NaN,"SELECT C.CustomerID, COUNT(O.OrderID) AS order...",True,"['northwind', 'flights']",10.0,NaN
4,"Databases for Business Analytics, Winter 2023","251,683",Final Exam,"283,453",1,"4,969,709",Show the date/time of the first order ever dat...,Long Answer Question,use northwind;\nSELECT \n min(OrderDate) as...,7.5,ab3864,NaN,SELECT MIN(OrderDate) AS earliestOrderDate\nFR...,True,"['northwind', 'flights']",7.5,NaN

## Table Schemas

In [5]:
!pip3 install -U PyMySQL sqlalchemy sql_magic

Collecting PyMySQL
  Downloading PyMySQL-1.1.0-py3-none-any.whl (44 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 44.8/44.8 kB 5.1 MB/s eta 0:00:00
Requirement already satisfied: sqlalchemy in /usr/local/lib/python3.10/dist-packages (2.0.16)
Collecting sqlalchemy
  Downloading SQLAlchemy-2.0.18-cp310-cp310-manylinux_2_17_x86_64.manylinux2014_x86_64.whl (2.7 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 2.7/2.7 MB 71.7 MB/s eta 0:00:00
Collecting sql_magic
  Downloading sql_magic-0.0.4-py3-none-any.whl (10 kB)
Requirement already satisfied: typing-extensions>=4.2.0 in /usr/local/lib/python3.10/dist-packages (from sqlalchemy) (4.6.3)
Requirement already satisfied: greenlet!=0.4.17 in /usr/local/lib/python3.10/dist-packages (from sqlalchemy) (2.0.2)
Collecting findspark (from sql_magic)
  Downloading findspark-2.0.1-py2.py3-none-any.whl (4.4 kB)
Requirement already satisfied: ipython in /usr/local/lib/python3.10/dist-packages (from sql_magic) (7.34.0)
Collecting jupyter (from sql_magic)
  Downloading jupyter-1.0.0-py2.py3-none-any.whl (2.7 kB)
Requirement already satisfied: pandas in /usr/local/lib/python3.10/dist-packages (from sql_magic) (1.5.3)
Requirement already satisfied: sqlparse in /usr/local/lib/python3.10/dist-packages (from sql_magic) (0.4.4)
Requirement already satisfied: traitlets in /usr/local/lib/python3.10/dist-packages (from sql_magic) (5.7.1)
Requirement already satisfied: setuptools>=18.5 in /usr/local/lib/python3.10/dist-packages (from ipython->sql_magic) (67.7.2)
Collecting jedi>=0.16 (from ipython->sql_magic)
  Downloading jedi-0.18.2-py2.py3-none-any.whl (1.6 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 1.6/1.6 MB 71.3 MB/s eta 0:00:00
Requirement already satisfied: decorator in /usr/local/lib/python3.10/dist-packages (from ipython->sql_magic) (4.4.2)
Requirement already satisfied: pickleshare in /usr/local/lib/python3.10/dist-packages (from ipython->sql_magic) (0.7.5)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in /usr/local/lib/python3.10/dist-packages (from ipython->sql_magic) (3.0.38)
Requirement already satisfied: pygments in /usr/local/lib/python3.10/dist-packages (from ipython->sql_magic) (2.14.0)
Requirement already satisfied: backcall in /usr/local/lib/python3.10/dist-packages (from ipython->sql_magic) (0.2.0)
Requirement already satisfied: matplotlib-inline in /usr/local/lib/python3.10/dist-packages (from ipython->sql_magic) (0.1.6)
Requirement already satisfied: pexpect>4.3 in /usr/local/lib/python3.10/dist-packages (from ipython->sql_magic) (4.8.0)
Requirement already satisfied: notebook in /usr/local/lib/python3.10/dist-packages (from jupyter->sql_magic) (6.4.8)
Collecting qtconsole (from jupyter->sql_magic)
  Downloading qtconsole-5.4.3-py3-none-any.whl (121 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 121.9/121.9 kB 15.8 MB/s eta 0:00:00
Requirement already satisfied: jupyter-console in /usr/local/lib/python3.10/dist-packages (from jupyter->sql_magic) (6.1.0)
Requirement already satisfied: nbconvert in /usr/local/lib/python3.10/dist-packages (from jupyter->sql_magic) (6.5.4)
Requirement already satisfied: ipykernel in /usr/local/lib/python3.10/dist-packages (from jupyter->sql_magic) (5.5.6)
Requirement already satisfied: ipywidgets in /usr/local/lib/python3.10/dist-packages (from jupyter->sql_magic) (7.7.1)
Requirement already satisfied: python-dateutil>=2.8.1 in /usr/local/lib/python3.10/dist-packages (from pandas->sql_magic) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /usr/local/lib/python3.10/dist-packages (from pandas->sql_magic) (2022.7.1)
Requirement already satisfied: numpy>=1.21.0 in /usr/local/lib/python3.10/dist-packages (from pandas->sql_magic) (1.22.4)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in /usr/local/lib/python3.10/dist-packages (from jedi>=0.16->ipython->sql_magic) (0.8.3)
Requirement already satisfied: ptyprocess>=0.5 in /usr/local/lib/python3.10/dist-packages (from pexpect>4.3->ipython->sql_magic) (0.7.0)
Requirement already satisfied: wcwidth in /usr/local/lib/python3.10/dist-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython->sql_magic) (0.2.6)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.10/dist-packages (from python-dateutil>=2.8.1->pandas->sql_magic) (1.16.0)
Requirement already satisfied: ipython-genutils in /usr/local/lib/python3.10/dist-packages (from ipykernel->jupyter->sql_magic) (0.2.0)
Requirement already satisfied: jupyter-client in /usr/local/lib/python3.10/dist-packages (from ipykernel->jupyter->sql_magic) (6.1.12)
Requirement already satisfied: tornado>=4.2 in /usr/local/lib/python3.10/dist-packages (from ipykernel->jupyter->sql_magic) (6.3.1)
Requirement already satisfied: widgetsnbextension~=3.6.0 in /usr/local/lib/python3.10/dist-packages (from ipywidgets->jupyter->sql_magic) (3.6.4)
Requirement already satisfied: jupyterlab-widgets>=1.0.0 in /usr/local/lib/python3.10/dist-packages (from ipywidgets->jupyter->sql_magic) (3.0.7)
Requirement already satisfied: lxml in /usr/local/lib/python3.10/dist-packages (from nbconvert->jupyter->sql_magic) (4.9.2)
Requirement already satisfied: beautifulsoup4 in /usr/local/lib/python3.10/dist-packages (from nbconvert->jupyter->sql_magic) (4.11.2)
Requirement already satisfied: bleach in /usr/local/lib/python3.10/dist-packages (from nbconvert->jupyter->sql_magic) (6.0.0)
Requirement already satisfied: defusedxml in /usr/local/lib/python3.10/dist-packages (from nbconvert->jupyter->sql_magic) (0.7.1)
Requirement already satisfied: entrypoints>=0.2.2 in /usr/local/lib/python3.10/dist-packages (from nbconvert->jupyter->sql_magic) (0.4)
Requirement already satisfied: jinja2>=3.0 in /usr/local/lib/python3.10/dist-packages (from nbconvert->jupyter->sql_magic) (3.1.2)
Requirement already satisfied: jupyter-core>=4.7 in /usr/local/lib/python3.10/dist-packages (from nbconvert->jupyter->sql_magic) (5.3.1)
Requirement already satisfied: jupyterlab-pygments in /usr/local/lib/python3.10/dist-packages (from nbconvert->jupyter->sql_magic) (0.2.2)
Requirement already satisfied: MarkupSafe>=2.0 in /usr/local/lib/python3.10/dist-packages (from nbconvert->jupyter->sql_magic) (2.1.3)
Requirement already satisfied: mistune<2,>=0.8.1 in /usr/local/lib/python3.10/dist-packages (from nbconvert->jupyter->sql_magic) (0.8.4)
Requirement already satisfied: nbclient>=0.5.0 in /usr/local/lib/python3.10/dist-packages (from nbconvert->jupyter->sql_magic) (0.8.0)
Requirement already satisfied: nbformat>=5.1 in /usr/local/lib/python3.10/dist-packages (from nbconvert->jupyter->sql_magic) (5.9.0)
Requirement already satisfied: packaging in /usr/local/lib/python3.10/dist-packages (from nbconvert->jupyter->sql_magic) (23.1)
Requirement already satisfied: pandocfilters>=1.4.1 in /usr/local/lib/python3.10/dist-packages (from nbconvert->jupyter->sql_magic) (1.5.0)
Requirement already satisfied: tinycss2 in /usr/local/lib/python3.10/dist-packages (from nbconvert->jupyter->sql_magic) (1.2.1)
Requirement already satisfied: pyzmq>=17 in /usr/local/lib/python3.10/dist-packages (from notebook->jupyter->sql_magic) (23.2.1)
Requirement already satisfied: argon2-cffi in /usr/local/lib/python3.10/dist-packages (from notebook->jupyter->sql_magic) (21.3.0)
Requirement already satisfied: nest-asyncio>=1.5 in /usr/local/lib/python3.10/dist-packages (from notebook->jupyter->sql_magic) (1.5.6)
Requirement already satisfied: Send2Trash>=1.8.0 in /usr/local/lib/python3.10/dist-packages (from notebook->jupyter->sql_magic) (1.8.2)
Requirement already satisfied: terminado>=0.8.3 in /usr/local/lib/python3.10/dist-packages (from notebook->jupyter->sql_magic) (0.17.1)
Requirement already satisfied: prometheus-client in /usr/local/lib/python3.10/dist-packages (from notebook->jupyter->sql_magic) (0.17.0)
Collecting qtpy>=2.0.1 (from qtconsole->jupyter->sql_magic)
  Downloading QtPy-2.3.1-py3-none-any.whl (84 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 84.9/84.9 kB 10.3 MB/s eta 0:00:00
Requirement already satisfied: platformdirs>=2.5 in /usr/local/lib/python3.10/dist-packages (from jupyter-core>=4.7->nbconvert->jupyter->sql_magic) (3.7.0)
Requirement already satisfied: fastjsonschema in /usr/local/lib/python3.10/dist-packages (from nbformat>=5.1->nbconvert->jupyter->sql_magic) (2.17.1)
Requirement already satisfied: jsonschema>=2.6 in /usr/local/lib/python3.10/dist-packages (from nbformat>=5.1->nbconvert->jupyter->sql_magic) (4.3.3)
Requirement already satisfied: argon2-cffi-bindings in /usr/local/lib/python3.10/dist-packages (from argon2-cffi->notebook->jupyter->sql_magic) (21.2.0)
Requirement already satisfied: soupsieve>1.2 in /usr/local/lib/python3.10/dist-packages (from beautifulsoup4->nbconvert->jupyter->sql_magic) (2.4.1)
Requirement already satisfied: webencodings in /usr/local/lib/python3.10/dist-packages (from bleach->nbconvert->jupyter->sql_magic) (0.5.1)
Requirement already satisfied: attrs>=17.4.0 in /usr/local/lib/python3.10/dist-packages (from jsonschema>=2.6->nbformat>=5.1->nbconvert->jupyter->sql_magic) (23.1.0)
Requirement already satisfied: pyrsistent!=0.17.0,!=0.17.1,!=0.17.2,>=0.14.0 in /usr/local/lib/python3.10/dist-packages (from jsonschema>=2.6->nbformat>=5.1->nbconvert->jupyter->sql_magic) (0.19.3)
Requirement already satisfied: cffi>=1.0.1 in /usr/local/lib/python3.10/dist-packages (from argon2-cffi-bindings->argon2-cffi->notebook->jupyter->sql_magic) (1.15.1)
Requirement already satisfied: pycparser in /usr/local/lib/python3.10/dist-packages (from cffi>=1.0.1->argon2-cffi-bindings->argon2-cffi->notebook->jupyter->sql_magic) (2.21)
Installing collected packages: findspark, sqlalchemy, qtpy, PyMySQL, jedi, qtconsole, jupyter, sql_magic
  Attempting uninstall: sqlalchemy
    Found existing installation: SQLAlchemy 2.0.16
    Uninstalling SQLAlchemy-2.0.16:
      Successfully uninstalled SQLAlchemy-2.0.16
Successfully installed PyMySQL-1.1.0 findspark-2.0.1 jedi-0.18.2 jupyter-1.0.0 qtconsole-5.4.3 qtpy-2.3.1 sql_magic-0.0.4 sqlalchemy-2.0.18

In [6]:
from sqlalchemy import create_engine
from sqlalchemy import text

In [7]:
db_list = ['flights', 'imdb', 'music', 'restaurants', 'facebook', 'northwind', 'collisions']

def db_schema(db_name):
  conn_string = 'mysql+pymysql://{user}:{password}@{host}/{db}?charset=utf8mb4'.format(
    host = 'db.ipeirotis.org',
    user = 'student',
    password = 'dwdstudent2015',
    db = db_name,
    encoding = 'utf8mb4')
  engine = create_engine(conn_string)

  with engine.begin() as conn:
    tables = pd.read_sql_query(sql=text('show tables'), con=conn)
    tables = tables.iloc[:,-1].tolist()

    schema_list = []
    for t in tables:
      d = pd.read_sql_query(sql=text(f'describe {t}'), con=conn)
      table_schema = {t:d.loc[:,'Field'].tolist()}
      schema_list.append(table_schema)
  return schema_list

In [8]:
flights_schema = db_schema('flights')
imdb_schema = db_schema('imdb')
music_schema = db_schema('music')
restaurants_schema = db_schema('restaurants')
facebook_schema = db_schema('facebook')
northwind_schema = db_schema('northwind')
collisions_schema = db_schema('collisions')

print(facebook_schema)

[{'Concentration': ['ProfileID', 'Concentration']}, {'FavoriteBooks': ['ProfileID', 'Book']}, {'FavoriteMovies': ['ProfileID', 'Movie']}, {'FavoriteMusic': ['ProfileID', 'Music']}, {'FavoriteTVShows': ['ProfileID', 'TVShow']}, {'Hobbies': ['ProfileID', 'Hobby']}, {'LookingFor': ['ProfileID', 'LookingFor']}, {'Orientation': ['ProfileID', 'InterestedIn']}, {'Profiles': ['ProfileID', 'Name', 'MemberSince', 'LastUpdate', 'School', 'Status', 'Sex', 'Birthday', 'AIM', 'Website', 'PoliticalViews', 'Geography', 'HighSchool', 'HomeTown', 'HomeState', 'Residence', 'CurrentAddress', 'CurrentTown', 'CurrentState']}, {'Relationship': ['ProfileID', 'Status']}, {'chart': ['music', 'gender', 'cnt', 'music_rank']}, {'popular_music': ['music', 'cnt']}, {'popular_music_by_sex': ['music', 'gender', 'cnt']}]

In [9]:
schema_mapping = {
    'flights': flights_schema,
    'imdb': imdb_schema,
    'music': music_schema,
    'restaurants': restaurants_schema,
    'facebook': facebook_schema,
    'northwind': northwind_schema,
    'collisions': collisions_schema,
    "['northwind', 'flights']": [northwind_schema, flights_schema]
}

In [10]:
# # print(schema_fun(['northwind', 'flights']))
# import re
# def convert_to_list(string):
#     # Remove the square brackets and extra spaces
#     cleaned_string = re.sub(r'\[|\]', '', string).strip()
#     # Split the string into individual elements
#     elements = [elem.strip() for elem in cleaned_string.split(',')]
#     # Return the converted list
#     return elements

In [11]:
# def schema_fun(db):
#   if isinstance(db, list):
#     # schema_list = []
#     # for name in db:
#     #   schema_list.append(db_schema(name))
#     # return schema_list
#     return [db_schema(name) for name in db]
#   else:
#     return db_schema(db)

In [10]:
data['schema'] = data['Database'].map(schema_mapping)
data.head()

,BSpace Course Name,BSpace Course Id,QuizName,﻿QuizId,QuizAttemptNumber,QuestionId,Question,QuestionType,InputUserAnswer,Score,NetId,Comment left on User Response,AnswerKey,isQuery,Database,full_score,feedback,schema
0,"Databases for Business Analytics, Winter 2023","251,683",Final Exam,"283,453",1,"4,969,729",Hard question. Requires use of subqueries and ...,Long Answer Question,"SELECT \n A.CustomerID,\n A.CompanyName,...",10.0,ab3864,Results for identical to the answer key becaus...,"WITH total_spent AS (\nSELECT C.CustomerID, C....",True,"['northwind', 'flights']",10.0,The feedback from the TA was Results for ident...,"[[{'Categories': ['CategoryID', 'CategoryName'..."
1,"Databases for Business Analytics, Winter 2023","251,683",Final Exam,"283,453",1,"4,969,713","For each order, show the customerID who placed...",Long Answer Question,"Select O.OrderID, O.CustomerID, Count(D.Produ...",5.5,ab3864,-3 pts for lack for HAVING\n-1 pts for using t...,"SELECT O.OrderID, O.CustomerID\n&#160; &#160; ...",True,"['northwind', 'flights']",10.0,The feedback from the TA was -3 pts for lack f...,"[[{'Categories': ['CategoryID', 'CategoryName'..."
2,"Databases for Business Analytics, Winter 2023","251,683",Final Exam,"283,453",1,"4,969,711",We want to identify the ship countries with th...,Long Answer Question,"use northwind;\nSELECT \n ShipCountry, AVG(...",7.0,ab3864,"It is ""LIMIT 3"" not ""LIMIT = 3""","SELECT ShipCountry, ROUND(AVG(Freight),2) AS A...",True,"['northwind', 'flights']",7.5,"The feedback from the TA was It is ""LIMIT 3"" n...","[[{'Categories': ['CategoryID', 'CategoryName'..."
3,"Databases for Business Analytics, Winter 2023","251,683",Final Exam,"283,453",1,"4,969,710",For every customer in the database list the nu...,Long Answer Question,"Select C.CompanyName, C.CustomerID, sum(case w...",10.0,ab3864,NaN,"SELECT C.CustomerID, COUNT(O.OrderID) AS order...",True,"['northwind', 'flights']",10.0,NaN,"[[{'Categories': ['CategoryID', 'CategoryName'..."
4,"Databases for Business Analytics, Winter 2023","251,683",Final Exam,"283,453",1,"4,969,709",Show the date/time of the first order ever dat...,Long Answer Question,use northwind;\nSELECT \n min(OrderDate) as...,7.5,ab3864,NaN,SELECT MIN(OrderDate) AS earliestOrderDate\nFR...,True,"['northwind', 'flights']",7.5,NaN,"[[{'Categories': ['CategoryID', 'CategoryName'..."

In [11]:
data = data.replace('&nbsp;', ' ', regex=True)
data = data.replace('&#160;', ' ', regex=True)

## Group questions

In [12]:
from sklearn.model_selection import train_test_split

In [13]:
# train_df, test_df = train_test_split(data, test_size=0.2, stratify=data['QuestionId'], random_state=1234)

In [14]:
df = data[data['QuestionId']=='5,119,721']
df.head()

,BSpace Course Name,BSpace Course Id,QuizName,﻿QuizId,QuizAttemptNumber,QuestionId,Question,QuestionType,InputUserAnswer,Score,NetId,Comment left on User Response,AnswerKey,isQuery,Database,full_score,feedback,schema
158,"Databases for Business Analytics, Spring'23","251,685",Assignment 3: Joins,"295,367",1,"5,119,721","List all the track names, the corresponding al...",Long Answer Question,"select T.track_name, L.album_name, a.artist_na...",1.0,my2204,NaN,"SELECT track_name, artist_name, album_name\nFR...",True,music,1.0,NaN,"[{'album': ['artist_id', 'album_id', 'album_na..."
219,"Databases for Business Analytics, Spring'23","251,685",Assignment 3: Joins,"295,367",1,"5,119,721","List all the track names, the corresponding al...",Long Answer Question,"SELECT track_name, artist_name, album_name\nFR...",0.5,ql2084,NaN,"SELECT track_name, artist_name, album_name\nFR...",True,music,1.0,NaN,"[{'album': ['artist_id', 'album_id', 'album_na..."
289,"Databases for Business Analytics, MSQM SU23","277,478",Assignment 3: Joins,"301,296",1,"5,119,721","List all the track names, the corresponding al...",Long Answer Question,"USE music;\nSHOW tables;\nSELECT track_name, a...",1.0,soj206,NaN,"SELECT track_name, artist_name, album_name\nFR...",True,music,1.0,NaN,"[{'album': ['artist_id', 'album_id', 'album_na..."
332,"Databases for Business Analytics, MSQM SU23","277,478",Assignment 3: Joins,"301,296",1,"5,119,721","List all the track names, the corresponding al...",Long Answer Question,"SELECT T.track_name, A1.artist_name, A2.album_...",0.7,pp1711,\n\n\nAnswer Key\n\n\n\n\n\n\n\nSELECT track_n...,"SELECT track_name, artist_name, album_name\nFR...",True,music,1.0,The feedback from the TA was \n\n\nAnswer Key\...,"[{'album': ['artist_id', 'album_id', 'album_na..."
420,"Databases for Business Analytics, Spring'23","251,685",Assignment 3: Joins,"295,367",1,"5,119,721","List all the track names, the corresponding al...",Long Answer Question,"Select T.track_name, L.album_name, A.artist_na...",1.0,sek495,NaN,"SELECT track_name, artist_name, album_name\nFR...",True,music,1.0,NaN,"[{'album': ['artist_id', 'album_id', 'album_na..."

In [15]:
qids = df['QuestionId'].unique()
print(qids)

['5,119,721']

In [17]:
for id in qids:
  temp = df[df['QuestionId']==id]
  # making test size 1
  train_df, test_df = train_test_split(temp, test_size=1, random_state=1234)
  train_df = train_df.reset_index()
  test_df = test_df.reset_index()

  submissions = ""
  for i,row in train_df.iterrows():
    submission = row['InputUserAnswer']
    grade = row['Score']
    full_grade = row['full_score']
    feedback = row['feedback']
    submissions += f'e{i}. submission: {submission}, grade: {grade}/{full_grade}, feedback: {feedback} \n\n'

  # print(submissions)
  db = train_df.loc[0,'Database']
  tables = train_df.loc[0,'schema']
  question = train_df.loc[0,'Question']
  key = train_df.loc[0,'AnswerKey']

  test = test_df.loc[0,'InputUserAnswer']

  mega_p = f'''
    a. We are working with the {db} database, which has the following tables: {tables}

    b. The request to the student is "{question}"

    c. The model answer is {key} (note that we may have multiple correct answers, the model answer is just an example)

    d. The student answer was {test}

    e. Previously, students have submitted these answers and got back these responses and grades: \n{submissions}

    Please provide a grade and feedback for the student
    '''
  print(mega_p)

  # try prompt with and without e part (zero & few shot), training set - 1,2,3...
  # gpt already knows northwind database
  # see what we get back

    a. We are working with the music database, which has the following tables: [{'album': ['artist_id', 'album_id', 'album_name']}, {'artist': ['artist_id', 'artist_name']}, {'track': ['artist_id', 'album_id', 'track_id', 'track_name', 'time']}, {'tracks_played': ['user_id', 'artist_id', 'album_id', 'track_id', 'played_on']}, {'users': ['user_id', 'gender', 'first_name', 'last_name']}]

    b. The request to the student is "List all the track names, the corresponding album name, and the corresponding artist name"

    c. The model answer is SELECT track_name, artist_name, album_name
FROM track T
  JOIN artist R ON T.artist_id = R.artist_id
  JOIN album A ON A.album_id = T.album_id AND A.artist_id = T.artist_id (note that we may have multiple correct answers, the model answer is just an example)

    d. The student answer was SELECT T.track_name, A2.artist_name, A1.album_name
FROM track T
INNER JOIN album A1 ON T.artist_id = A1.artist_id AND T.album_id = A1.album_id
INNER JOIN artist A2 ON T.artist_id = A2.artist_id ;

    e. Previously, students have submitted these answers and got back these responses and grades:
e0. submission: select track_name, artist_name, album_name
from album as a
inner join track as t on a.artist_id = t.artist_id AND a.album_id = t.album_id
inner join artist as ar on a.artist_id = ar.artist_id;, grade: 1.0/1.0, feedback: nan

e1. submission: SELECT  TR.track_name, AR.artist_name, AL.album_name
FROM track TR
     INNER JOIN album AL ON AL.artist_id = TR.artist_id
     INNER JOIN artist AR ON AR.artist_id = AL.artist_id;, grade: 0.7/1.0, feedback: The feedback from the TA was


Answer Key







SELECT track_name, artist_name, album_name
FROM track T
  JOIN artist R ON T.artist_id = R.artist_id
  JOIN album A ON A.album_id = T.album_id AND A.artist_id = T.artist_id








e2. submission: select K.track_name, A.album_name, T.artist_name
from track K
inner join album A on A.artist_id = K.artist_id and A.album_id = K.album_id
inner join artist T on K.artist_id = T.artist_id;, grade: 1.0/1.0, feedback: nan

e3. submission: select t.track_name, a.album_name, ar.artist_name
from track as t
inner join album as a on t.artist_id = a.artist_id
inner join artist as ar on t.artist_id = ar.artist_id; , grade: 0.7/1.0, feedback: The feedback from the TA was SELECT track_name, artist_name, album_name
FROM track T
  JOIN artist R ON T.artist_id = R.artist_id
  JOIN album A ON A.album_id = T.album_id AND A.artist_id = T.artist_id

e4. submission: SELECT T.track_name, L.album_name, R.artist_name
FROM track T
   INNER JOIN album L ON L.album_id = T.album_id AND
   L.artist_id = T.artist_id
   INNER JOIN artist R ON R.artist_id = T.artist_id;
, grade: 0.5/1.0, feedback: nan

e5. submission: select *
FROM track T inner join album A inner join artist AN
	ON T.artist_id = A.artist_id AND T.album_id = A.album_id;, grade: 0.7/1.0, feedback: The feedback from the TA was


Answer Key







SELECT track_name, artist_name, album_name
FROM track T
  JOIN artist R ON T.artist_id = R.artist_id
  JOIN album A ON A.album_id = T.album_id AND A.artist_id = T.artist_id








e6. submission: SELECT track.track_name, album.album_name, artist.artist_name
FROM track
INNER JOIN album on track.album_id = album.album_id and track.artist_id = album.artist_id
INNER JOIN artist on album.artist_id = artist.artist_id
;, grade: 1.0/1.0, feedback: nan

e7. submission: SELECT track_name , artist_name , album_name
FROM track AS T
JOIN artist AS R ON T.artist_id = R.artist_id
JOIN album AS A ON A.album_id = T.album_id AND A.artist_id = T.artist_id;, grade: 1.0/1.0, feedback: nan

e8. submission: SELECT T.track_name, C.artist_name, B.album_name
FROM track AS T
	INNER JOIN album AS B ON T.album_id = B.album_id AND T.artist_id = B.artist_id
       INNER JOIN artist AS C ON T.artist_id = C.artist_id;, grade: 1.0/1.0, feedback: nan

e9. submission: select T.track_name, A.artist_name, L.album_name
from track T
inner join album L on T.album_id = L.album_id and T.artist_id = L.artist_id
inner join artist A on A.artist_id = T.artist_id;, grade: 1.0/1.0, feedback: nan

e10. submission: select t.track_name,ar.artist_name,al.album_name from track t,artist ar,album al
where al.artist_id = ar.artist_id and t.artist_id = ar.artist_id and t.album_id = al.album_id
, grade: 1.0/1.0, feedback: nan

e11. submission: select T.track_name, AL.album_name, ART.artist_name
	from track T
	inner join album AL on T.album_id = AL.album_id AND AL.artist_id = T.artist_id
	inner join artist ART on T.artist_id = ART.artist_id;, grade: 1.0/1.0, feedback: nan

e12. submission: select 	t.track_name,
		al.album_name,
		a.artist_name
from artist a
	inner join album al on al.artist_id = a.artist_id
	inner join track t on t.album_id = al.album_id and t.artist_id = al.artist_id;, grade: 1.0/1.0, feedback: nan

e13. submission: Select T.track_name, L.album_name, A.artist_name
From track T
    Inner Join album L on L.album_id = T.album_id AND L.artist_id = T.artist_id
    Inner Join artist A on A.artist_id = L.artist_id;, grade: 1.0/1.0, feedback: nan

e14. submission: select
t.track_name,
a.artist_name,
alb.album_name
FROM track t
LEFT JOIN album alb
ON t.album_id=alb.album_id AND t.artist_id=alb.artist_id
LEFT JOIN artist a
ON t.artist_id=a.artist_id;

OR

select
t.track_name,
a.artist_name,
alb.album_name
FROM track t
LEFT JOIN album alb
ON t.album_id=alb.album_id AND t.artist_id=alb.artist_id
LEFT JOIN artist a
ON alb.artist_id=a.artist_id;, grade: 1.0/1.0, feedback: nan

e15. submission: # List all the track names, the corresponding album name, and the corresponding artist name
SELECT T.track_name, L.album_name, A.artist_name
FROM track T
	Inner Join album L on L.album_id = T.album_id AND L.artist_id = T.artist_id
       Inner Join artist A on A.artist_id = L.artist_id;
, grade: 1.0/1.0, feedback: nan

e16. submission: SELECT *
FROM track A
	INNER JOIN album B ON A.album_id = B.album_id AND A.artist_id = B.artist_id
    INNER JOIN artist C ON A.artist_id = C.artist_id;, grade: 1.0/1.0, feedback: nan

e17. submission:  select T.track_name,A.album_name,AR.artist_name
  from track T
  INNER JOIN artist AR on T.artist_id=AR.artist_id
  INNER JOIN album A on T.album_id=A.album_id;, grade: 0.7/1.0, feedback: The feedback from the TA was SELECT track_name, artist_name, album_name
FROM track T
  JOIN artist R ON T.artist_id = R.artist_id
  JOIN album A ON A.album_id = T.album_id AND A.artist_id = T.artist_id

e18. submission: show databases;
USE music;
select T.track_name, A.artist_name, B.album_name
FROM track AS T
inner join artist as A
on T.artist_id = A.artist_id
inner join album as B
on T.album_id = B.album_id AND T.artist_id = B.artist_id
;

, grade: 1.0/1.0, feedback: nan

e19. submission: SELECT t.track_name, a.artist_name, al.album_name
FROM track t
 INNER JOIN album al ON t.artist_id=al.artist_id AND t.album_id=al.album_id
 INNER JOIN artist a ON t.artist_id=a.artist_id;, grade: 1.0/1.0, feedback: nan

e20. submission: select tr.track_name, al.album_name, ar.artist_name from album al inner join track tr on al.artist_id = tr.artist_id and al.album_id = tr.album_id inner join artist ar on al.artist_id = ar.artist_id;
, grade: 1.0/1.0, feedback: nan

e21. submission: SELECT T.track_name, A.artist_name, AL.album_name
FROM track T INNER JOIN album AL ON T.artist_id = AL.artist_id AND T.album_id = AL.album_id
INNER JOIN artist A ON A.artist_id = AL.artist_id;, grade: 1.0/1.0, feedback: nan

e22. submission: select track_name, artist_name, album_name from artist as A
INNER JOIN album as B on A.artist_id = B.artist_id
INNER JOIN track as T on B.album_id = T.album_id;, grade: 0.7/1.0, feedback: The feedback from the TA was SELECT track_name, artist_name, album_name
FROM track T
  JOIN artist R ON T.artist_id = R.artist_id
  JOIN album A ON A.album_id = T.album_id AND A.artist_id = T.artist_id

e23. submission: select track_name, R.artist_name, A.album_name
from track T
	inner join artist R
    on T.artist_id = R.artist_id
    inner join album A
    on R.artist_id = A.artist_id;
, grade: 0.7/1.0, feedback: The feedback from the TA was SELECT track_name, artist_name, album_name
FROM track T
  JOIN artist R ON T.artist_id = R.artist_id
  JOIN album A ON A.album_id = T.album_id AND A.artist_id = T.artist_id

e24. submission: SELECT T.track_name, A.album_name, B.artist_name
FROM track T
	INNER JOIN album A ON T.artist_id = A.artist_id AND T.album_id = A.album_id
       INNER JOIN artist B ON A.artist_id = B.artist_id;, grade: 1.0/1.0, feedback: nan

e25. submission: Select track_name,artist_name,album_name
From track T
	Inner Join album B on T.artist_id = B.artist_id AND T.album_id = B.album_id
	Inner Join artist A on A.artist_id = B.artist_id;

, grade: 1.0/1.0, feedback: nan

e26. submission: select t.track_name, a.artist_name, ab.album_name from artist a
inner join album ab on a.artist_id = ab.artist_id
inner join track as t on ab.album_id = t.album_id and a.artist_id = t.artist_id;, grade: 1.0/1.0, feedback: nan

e27. submission: USE music;
SELECT M.track_name, G.album_name, H.artist_name
FROM album G
	INNER JOIN track M ON M.album_id = G.album_id AND M.artist_id = G.artist_id
    INNER JOIN artist H ON H.artist_id = G.artist_id;, grade: 1.0/1.0, feedback: nan

e28. submission: SELECT T.track_name, A.album_name, AR.artist_name FROM track AS T
INNER JOIN album AS A ON T.album_id = A.album_id AND T.artist_id = A.artist_id
INNER JOIN artist AS AR ON T.artist_id = AR.artist_id;, grade: 1.0/1.0, feedback: nan

e29. submission: select
trk.track_name,
art.artist_name,
alb.album_name
from track as trk
	inner join album as alb on alb.album_id = trk.album_id
	inner join artist as art on trk.artist_id = art.artist_id;



I could not get this query to work as described in the solution below. Please provide guidance. Thanks, grade: 0.7/1.0, feedback: The feedback from the TA was SELECT track_name, artist_name, album_name
FROM track T
  JOIN artist R ON T.artist_id = R.artist_id
  JOIN album A ON A.album_id = T.album_id AND A.artist_id = T.artist_id

e30. submission: SELECT T.track_name, AR.artist_name, AL.album_name
FROM track T
INNER JOIN artist AR ON AR.artist_id = T.artist_id
INNER JOIN album AL on AL.album_id = T.album_id;, grade: 0.7/1.0, feedback: The feedback from the TA was SELECT track_name, artist_name, album_name
FROM track T
  JOIN artist R ON T.artist_id = R.artist_id
  JOIN album A ON A.album_id = T.album_id AND A.artist_id = T.artist_id

e31. submission: SELECT T.track_name, AR.artist_name, AL.album_name
FROM track T
	INNER JOIN album AL
    ON T.artist_id = AL.artist_id AND T.album_id = AL.album_id
    INNER JOIN artist AR
    ON AR.artist_id=AL.artist_id AND AR.artist_id = T.artist_id;
    , grade: 1.0/1.0, feedback: nan

e32. submission: select track.track_name, artist.artist_name, album.album_name
from track
INNER JOIN album
ON track.artist_id = album.artist_id AND track.album_id = album.album_id
INNER JOIN artist
ON track.artist_id = artist.artist_id;, grade: 1.0/1.0, feedback: nan

e33. submission: select T.track_name,A.artist_name,Al.album_name
from track T
join artist A on A.artist_id=T.artist_id
join album Al on T.album_id=Al.album_id
where A.artist_id=Al.artist_id;, grade: 1.0/1.0, feedback: nan

e34. submission: SELECT t.track_name, a.album_name AS album_title, ar.artist_name
FROM track t
JOIN album a ON t.album_id = a.album_id AND t.artist_id = a.artist_id
JOIN artist ar ON a.artist_id = ar.artist_id;

, grade: 1.0/1.0, feedback: nan

e35. submission: select tn.track_name, an.artist_name, a.album_name
from track tn
	inner join album a
on tn.artist_id = a.artist_id and tn.album_id = a.album_id
		inner join artist an
        on an.artist_id = a.artist_id and an.artist_id = tn.artist_id;, grade: 1.0/1.0, feedback: nan

e36. submission: select track_name, artist_name, album_name
from music.track as t
inner join music.album as b
on (t.artist_id = b.artist_id
and t.album_id = b.album_id)
inner join music.artist as a
on t.artist_id = a.artist_id;, grade: 1.0/1.0, feedback: nan

e37. submission: select T.track_name, R.artist_name, A.album_name
from track as T
inner join album as A on A.album_id = T.album_id and A.artist_id = T.artist_id
inner join artist as R on T.artist_id = R.artist_id;

track_name, artist_name, album_name
Elegia	New Order	Retro - John McCready FAN
In A Lonely Place	New Order	Retro - John McCready FAN
Procession	New Order	Retro - John McCready FAN
Your Silent Face	New Order	Retro - John McCready FAN
Sunrise	New Order	Retro - John McCready FAN
Let's Go	New Order	Retro - John McCready FAN
Broken Promise	New Order	Retro - John McCready FAN
Dreams Never End	New Order	Retro - John McCready FAN
Cries And Whispers	New Order	Retro - John McCready FAN
All Day Long	New Order	Retro - John McCready FAN
Sooner Than You Think	New Order	Retro - John McCready FAN
Leave Me Alone	New Order	Retro - John McCready FAN
Lonesome Tonight	New Order	Retro - John McCready FAN
Every Little Counts	New Order	Retro - John McCready FAN
Run Wild	New Order	Retro - John Mc, grade: 1.0/1.0, feedback: nan

e38. submission: use music;

select t.track_name, ar.artist_name, al.album_name
from track t inner join album al on t.artist_id = al.artist_id and t.album_id = al.album_id
inner join artist ar on ar.artist_id = al.artist_id;
, grade: 1.0/1.0, feedback: nan

e39. submission: SELECT track_name, album_name, artist_name
FROM track T
     INNER JOIN album L ON T.album_id = L.album_id
     INNER JOIN artist ON L.artist_id = T.artist_id;, grade: 0.75/1.0, feedback: nan

e40. submission: SELECT t.track_name , a2.artist_name , a.album_name FROM track t
LEFT JOIN album a ON t.artist_id = a.artist_id
INNER JOIN artist a2 ON a.artist_id = a2.artist_id;, grade: 0.7/1.0, feedback: The feedback from the TA was SELECT track_name, artist_name, album_name
FROM track T
  JOIN artist R ON T.artist_id = R.artist_id
  JOIN album A ON A.album_id = T.album_id AND A.artist_id = T.artist_id

e41. submission: select T.track_name, L.album_name, R.artist_name
from track T
	left join album L on L.artist_id = T.artist_id and L.album_id = T.album_id
    left join artist R on R.artist_id = L.artist_id;, grade: 1.0/1.0, feedback: nan

e42. submission: select t.track_name, a.artist_name, b.album_name
from track as t
inner join artist as a on t.artist_id = a.artist_id
inner join album as b on b.artist_id = a.artist_id
where t.album_id = b.album_id and t.artist_id = b.artist_id;, grade: 1.0/1.0, feedback: nan

e43. submission: SELECT T.track_name, AR.artist_name, AL.album_name
FROM track T
	INNER JOIN album AL ON AL.artist_id = T.artist_id AND AL.album_id = T.album_id
    INNER JOIN artist AR ON  AR.artist_id = T.artist_id
;, grade: 1.0/1.0, feedback: nan

e44. submission: select t.track_name, a.artist_name, b.album_name
from track as t
join album as b on t.album_id=b.album_id
join artist as a on b.artist_id=a.artist_id;

trackname  artistname albumname

Elegia	New Order	Retro - John McCready FAN
Elegia	Nick Cave & The Bad Seeds	Let Love In
Elegia	Miles Davis	Live Around The World
Elegia	The Rolling Stones	Exile On Main Street
Elegia	The Stone Roses	Second Coming
Elegia	Kylie Minogue	Light Years
In A Lonely Place	New Order	Retro - John McCready FAN
In A Lonely Place	Nick Cave & The Bad Seeds	Let Love In
In A Lonely Place	Miles Davis	Live Around The World
In A Lonely Place	The Rolling Stones	Exile On Main Street
In A Lonely Place	The Stone Roses	Second Coming
In A Lonely Place	Kylie Minogue	Light Years
Procession	New Order	Retro - John McCready FAN
Procession	Nick Cave & The Bad Seeds	Let Love In
Procession	Miles Davis	Live Around The World
Procession	The Rolling Stones	Exile On Main Street
Procession	The Stone Roses	Second Coming
, grade: 1.0/1.0, feedback: nan

e45. submission: select T.track_name, B.artist_name, A.album_name
from track T
inner join album A on T.artist_id = A.artist_id AND T.album_id = A.album_id
inner join artist B on T.artist_id = B.artist_id;, grade: 1.0/1.0, feedback: nan

e46. submission: use music;
select track_name, artist_name, album_name
from artist as AR
inner join album as AL on AR.artist_id = AL.artist_id
inner join track as T on AL.album_id = T.album_id;

, grade: 0.7/1.0, feedback: The feedback from the TA was SELECT track_name, artist_name, album_name
FROM track T
  JOIN artist R ON T.artist_id = R.artist_id
  JOIN album A ON A.album_id = T.album_id AND A.artist_id = T.artist_id

e47. submission: select track_name,album_name,artist_name
from track
left join album
on track.album_id = album.album_id and album.artist_id = track.artist_id
left join artist
on artist.artist_id = track.artist_id;, grade: 1.0/1.0, feedback: nan

e48. submission: SELECT T.track_name, AR.artist_name, AL.album_name
FROM track T
	INNER JOIN artist AR ON AR.artist_id = T.artist_id
    INNER JOIN album AL ON AL.album_id = T.album_id
	WHERE AL.artist_id = T.artist_id;, grade: 1.0/1.0, feedback: nan

e49. submission: select *
from track t
	inner join artist a on t.artist_id = a.artist_id
    inner join album b on t.album_id = b.album_id;, grade: 0.5/1.0, feedback: nan

e50. submission: select t.track_name, a.artist_name, a1.album_name
from track t inner join album a1 on t.artist_id=a1.artist_id and t.album_id=a1.album_id
inner join artist a on a.artist_id=a1.artist_id;, grade: 1.0/1.0, feedback: nan

e51. submission: Use music;
SELECT track_name, artist_name, album_name
FROM track as A
	INNER JOIN artist as B
    INNER JOIN album as C
    ON A.artist_id = B.artist_id
    AND B.artist_id = C.artist_id
    AND A.album_id = C.album_id

Elegia	New Order	Retro - John McCready FAN
In A Lonely Place	New Order	Retro - John McCready FAN
Procession	New Order	Retro - John McCready FAN
Your Silent Face	New Order	Retro - John McCready FAN
Sunrise	New Order	Retro - John McCready FAN
Let's Go	New Order	Retro - John McCready FAN
Broken Promise	New Order	Retro - John McCready FAN
Dreams Never End	New Order	Retro - John McCready FAN
Cries And Whispers	New Order	Retro - John McCready FAN
All Day Long	New Order	Retro - John McCready FAN
Sooner Than You Think	New Order	Retro - John McCready FAN
Leave Me Alone	New Order	Retro - John McCready FAN
Lonesome Tonight	New Order	Retro - John McCready FAN
Every Little Counts	New Order	Retro - John McCready FAN
Run Wild	New Order	Retro - John McCready FAN, grade: 1.0/1.0, feedback: nan

e52. submission: SELECT A.track_name, B.artist_name, C.album_name
FROM track A
	INNER JOIN artist B ON A.artist_id = B.artist_ID
    INNER JOIN album C ON C.album_ID = A.album_ID AND C.artist_id = A.artist_id;, grade: 1.0/1.0, feedback: nan

e53. submission: select track.track_name, artist.artist_name, album.album_name
from track
INNER JOIN album
ON track.artist_id = album.artist_id
INNER JOIN artist
ON track.artist_id = artist.artist_id;, grade: 0.7/1.0, feedback: The feedback from the TA was



Answer Key







SELECT track_name, artist_name, album_name
FROM track T
  JOIN artist R ON T.artist_id = R.artist_id
  JOIN album A ON A.album_id = T.album_id AND A.artist_id = T.artist_id








e54. submission: SELECT track_name, artist_name, album_name
FROM track T
	INNER JOIN artist A ON T.artist_id = A.artist_id
       INNER JOIN album L ON T.album_id = L.album_id;, grade: 0.5/1.0, feedback: nan

e55. submission: select track_name, artist_name, album_name from track
	inner join album on (album.album_id = track.album_id and album.artist_id = track.artist_id)
       inner join artist on artist.artist_id = track.artist_id, grade: 1.0/1.0, feedback: nan

e56. submission: SELECT T.track_name, AL.album_name, A.artist_name
FROM track AS T
INNER JOIN album AS AL
ON AL.artist_id = T.artist_id AND AL.album_id = T.album_id
INNER JOIN artist AS A
ON AL.artist_id = A.artist_id;, grade: 1.0/1.0, feedback: nan

e57. submission: USE music;
SHOW tables;
SELECT track_name, artist_name, album_name
FROM track T
JOIN artist R ON T.artist_id = R.artist_id

## Mega Prompt

===============================

a. We are working with the XXX database, which has the following tables:
artist(id, first_name, last_name)
album(id, artist_id, name)
track....

b. The request to the student is "Fetch all the tracks for user X"

c. The model answer is ..... (note that we may have multiple correct
answers, the model answer is just an example)

d. The student answer was .....

e. Previously, students have submitted these answers and got back
these responses and grades:

e1. submission: ..... , grade: ..... , feedback

e2. submission: ..... , grade: ..... , feedback

e3. submission: ..... , grade: ..... , feedback

Please provide a grade and feedback for the student

===============================

In [18]:
# control the submissions number - zero shot / few shots
def generate_mega_prompt(df, submission_size):
  mega_df = pd.DataFrame(columns=['QuestionId', 'MegaPrompt'])

  qids = df['QuestionId'].unique()

  for id in qids:
    temp = df[df['QuestionId']==id]
    # making test size 1
    train_df, test_df = train_test_split(temp, test_size=1, random_state=1234)
    train_df = train_df.reset_index()
    test_df = test_df.reset_index()

    submissions = ""
    for i,row in train_df.iterrows():
      if i >= submission_size:
        break;
      submission = row['InputUserAnswer']
      grade = row['Score']
      full_grade = row['full_score']
      feedback = row['feedback']
      submissions += f'e{i}. submission: {submission}, grade: {grade}/{full_grade}, feedback: {feedback} \n\n'

    # print(submissions)
    db = train_df.loc[0,'Database']
    tables = train_df.loc[0,'schema']
    question = train_df.loc[0,'Question']
    key = train_df.loc[0,'AnswerKey']

    test = test_df.loc[0,'InputUserAnswer']

    mega_p = f'''
      a. We are working with the {db} database, which has the following tables: {tables}

      b. The request to the student is "{question}"

      c. The model answer is {key} (note that we may have multiple correct answers, the model answer is just an example)

      d. The student answer was {test}

      e. Previously, students have submitted these answers and got back these responses and grades: \n{submissions}

      Please provide a grade and feedback for the student
      '''
    new_row = {'QuestionId': id, 'MegaPrompt': mega_p}

    mega_df = mega_df.append(new_row, ignore_index=True)
  return mega_df

In [19]:
# using all submissions
def generate_mega_prompt_all(df):
  mega_df = pd.DataFrame(columns=['QuestionId', 'MegaPrompt'])

  qids = df['QuestionId'].unique()

  for id in qids:
    temp = df[df['QuestionId']==id]
    # making test size 1
    # drop the question if it has only 1 record now
    if len(temp)<=1:
      continue;
    train_df, test_df = train_test_split(temp, test_size=1, random_state=1234)
    train_df = train_df.reset_index()
    test_df = test_df.reset_index()

    submissions = ""
    for i,row in train_df.iterrows():
      submission = row['InputUserAnswer']
      grade = row['Score']
      full_grade = row['full_score']
      feedback = row['feedback']
      submissions += f'e{i}. submission: {submission}, grade: {grade}/{full_grade}, feedback: {feedback} \n\n'

    # print(submissions)
    db = train_df.loc[0,'Database']
    tables = train_df.loc[0,'schema']
    question = train_df.loc[0,'Question']
    key = train_df.loc[0,'AnswerKey']

    test = test_df.loc[0,'InputUserAnswer']

    mega_p = f'''
      a. We are working with the {db} database, which has the following tables: {tables}

      b. The request to the student is "{question}"

      c. The model answer is {key} (note that we may have multiple correct answers, the model answer is just an example)

      d. The student answer was {test}

      e. Previously, students have submitted these answers and got back these responses and grades: \n{submissions}

      Please provide a grade and feedback for the student
      '''
    new_row = {'QuestionId': id, 'MegaPrompt': mega_p}

    mega_df = mega_df.append(new_row, ignore_index=True)
  return mega_df

In [20]:
# for all questions each with all submissions => new df
mega_df_all = generate_mega_prompt_all(data)
mega_df_all.head()

<ipython-input-19-1b82def080c4>:48: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  mega_df = mega_df.append(new_row, ignore_index=True)
<ipython-input-19-1b82def080c4>:48: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  mega_df = mega_df.append(new_row, ignore_index=True)
<ipython-input-19-1b82def080c4>:48: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  mega_df = mega_df.append(new_row, ignore_index=True)
<ipython-input-19-1b82def080c4>:48: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  mega_df = mega_df.append(new_row, ignore_index=True)
<ipython-input-19-1b82def080c4>:48: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  mega_df = mega_df.append(new_row, ignore_index=True)
<ipython-input-19-1b82def080c4>:48: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  mega_df = mega_df.append(new_row, ignore_index=True)
<ipython-input-19-1b82def080c4>:48: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  mega_df = mega_df.append(new_row, ignore_index=True)
<ipython-input-19-1b82def080c4>:48: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  mega_df = mega_df.append(new_row, ignore_index=True)
<ipython-input-19-1b82def080c4>:48: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  mega_df = mega_df.append(new_row, ignore_index=True)
<ipython-input-19-1b82def080c4>:48: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  mega_df = mega_df.append(new_row, ignore_index=True)
<ipython-input-19-1b82def080c4>:48: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  mega_df = mega_df.append(new_row, ignore_index=True)
<ipython-input-19-1b82def080c4>:48: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  mega_df = mega_df.append(new_row, ignore_index=True)
<ipython-input-19-1b82def080c4>:48: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  mega_df = mega_df.append(new_row, ignore_index=True)
<ipython-input-19-1b82def080c4>:48: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  mega_df = mega_df.append(new_row, ignore_index=True)
<ipython-input-19-1b82def080c4>:48: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  mega_df = mega_df.append(new_row, ignore_index=True)
<ipython-input-19-1b82def080c4>:48: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  mega_df = mega_df.append(new_row, ignore_index=True)
<ipython-input-19-1b82def080c4>:48: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  mega_df = mega_df.append(new_row, ignore_index=True)
<ipython-input-19-1b82def080c4>:48: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  mega_df = mega_df.append(new_row, ignore_index=True)
<ipython-input-19-1b82def080c4>:48: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  mega_df = mega_df.append(new_row, ignore_index=True)
<ipython-input-19-1b82def080c4>:48: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  mega_df = mega_df.append(new_row, ignore_index=True)
<ipython-input-19-1b82def080c4>:48: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  mega_df = mega_df.append(new_row, ignore_index=True)
<ipython-input-19-1b82def080c4>:48: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  mega_df = mega_df.append(new_row, ignore_index=True)
<ipython-input-19-1b82def080c4>:48: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  mega_df = mega_df.append(new_row, ignore_index=True)
<ipython-input-19-1b82def080c4>:48: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  mega_df = mega_df.append(new_row, ignore_index=True)
<ipython-input-19-1b82def080c4>:48: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  mega_df = mega_df.append(new_row, ignore_index=True)
<ipython-input-19-1b82def080c4>:48: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  mega_df = mega_df.append(new_row, ignore_index=True)
<ipython-input-19-1b82def080c4>:48: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  mega_df = mega_df.append(new_row, ignore_index=True)
<ipython-input-19-1b82def080c4>:48: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  mega_df = mega_df.append(new_row, ignore_index=True)
<ipython-input-19-1b82def080c4>:48: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  mega_df = mega_df.append(new_row, ignore_index=True)
<ipython-input-19-1b82def080c4>:48: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  mega_df = mega_df.append(new_row, ignore_index=True)
<ipython-input-19-1b82def080c4>:48: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  mega_df = mega_df.append(new_row, ignore_index=True)
<ipython-input-19-1b82def080c4>:48: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  mega_df = mega_df.append(new_row, ignore_index=True)
<ipython-input-19-1b82def080c4>:48: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  mega_df = mega_df.append(new_row, ignore_index=True)
<ipython-input-19-1b82def080c4>:48: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  mega_df = mega_df.append(new_row, ignore_index=True)
<ipython-input-19-1b82def080c4>:48: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  mega_df = mega_df.append(new_row, ignore_index=True)
<ipython-input-19-1b82def080c4>:48: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  mega_df = mega_df.append(new_row, ignore_index=True)
<ipython-input-19-1b82def080c4>:48: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  mega_df = mega_df.append(new_row, ignore_index=True)
<ipython-input-19-1b82def080c4>:48: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  mega_df = mega_df.append(new_row, ignore_index=True)
<ipython-input-19-1b82def080c4>:48: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  mega_df = mega_df.append(new_row, ignore_index=True)
<ipython-input-19-1b82def080c4>:48: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  mega_df = mega_df.append(new_row, ignore_index=True)
<ipython-input-19-1b82def080c4>:48: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  mega_df = mega_df.append(new_row, ignore_index=True)
<ipython-input-19-1b82def080c4>:48: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  mega_df = mega_df.append(new_row, ignore_index=True)
<ipython-input-19-1b82def080c4>:48: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  mega_df = mega_df.append(new_row, ignore_index=True)
<ipython-input-19-1b82def080c4>:48: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  mega_df = mega_df.append(new_row, ignore_index=True)
<ipython-input-19-1b82def080c4>:48: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  mega_df = mega_df.append(new_row, ignore_index=True)
<ipython-input-19-1b82def080c4>:48: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  mega_df = mega_df.append(new_row, ignore_index=True)
<ipython-input-19-1b82def080c4>:48: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  mega_df = mega_df.append(new_row, ignore_index=True)
<ipython-input-19-1b82def080c4>:48: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  mega_df = mega_df.append(new_row, ignore_index=True)
<ipython-input-19-1b82def080c4>:48: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  mega_df = mega_df.append(new_row, ignore_index=True)
<ipython-input-19-1b82def080c4>:48: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  mega_df = mega_df.append(new_row, ignore_index=True)
<ipython-input-19-1b82def080c4>:48: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  mega_df = mega_df.append(new_row, ignore_index=True)
<ipython-input-19-1b82def080c4>:48: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  mega_df = mega_df.append(new_row, ignore_index=True)
<ipython-input-19-1b82def080c4>:48: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  mega_df = mega_df.append(new_row, ignore_index=True)
<ipython-input-19-1b82def080c4>:48: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  mega_df = mega_df.append(new_row, ignore_index=True)
<ipython-input-19-1b82def080c4>:48: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  mega_df = mega_df.append(new_row, ignore_index=True)
<ipython-input-19-1b82def080c4>:48: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  mega_df = mega_df.append(new_row, ignore_index=True)

  QuestionId                                         MegaPrompt
0  4,969,729  \n      a. We are working with the ['northwind...
1  4,969,713  \n      a. We are working with the ['northwind...
2  4,969,711  \n      a. We are working with the ['northwind...
3  4,969,710  \n      a. We are working with the ['northwind...
4  4,969,709  \n      a. We are working with the ['northwind...

In [21]:
print(mega_df_all.loc[0, 'MegaPrompt'])

      a. We are working with the ['northwind', 'flights'] database, which has the following tables: [[{'Categories': ['CategoryID', 'CategoryName', 'Description']}, {'CustomerGroupThresholds': ['CustomerGroupName', 'RangeBottom', 'RangeTop']}, {'Customers': ['CustomerID', 'CompanyName', 'ContactName', 'ContactTitle', 'Address', 'City', 'Region', 'PostalCode', 'Country', 'Phone', 'Fax']}, {'Employees': ['EmployeeID', 'LastName', 'FirstName', 'Title', 'TitleOfCourtesy', 'BirthDate', 'HireDate', 'Address', 'City', 'Region', 'PostalCode', 'Country', 'HomePhone', 'Extension', 'Notes', 'ReportsTo', 'PhotoPath']}, {'OrderDetails': ['OrderID', 'ProductID', 'UnitPrice', 'Quantity', 'Discount']}, {'Orders': ['OrderID', 'CustomerID', 'EmployeeID', 'OrderDate', 'RequiredDate', 'ShippedDate', 'ShipVia', 'Freight', 'ShipName', 'ShipAddress', 'ShipCity', 'ShipRegion', 'ShipPostalCode', 'ShipCountry']}, {'Products': ['ProductID', 'ProductName', 'SupplierID', 'CategoryID', 'QuantityPerUnit', 'UnitPrice', 'UnitsInStock', 'UnitsOnOrder', 'ReorderLevel', 'Discontinued']}, {'Shippers': ['ShipperID', 'CompanyName', 'Phone']}, {'Suppliers': ['SupplierID', 'CompanyName', 'ContactName', 'ContactTitle', 'Address', 'City', 'Region', 'PostalCode', 'Country', 'Phone', 'Fax', 'HomePage']}], [{'airports': ['airport', 'state', 'state_name']}, {'m_airports': ['airport', 'state', 'state_name']}, {'m_ticket_prices': ['origin', 'dest', 'carrier', 'fare', 'fare_per_mile', 'passengers', 'distance']}, {'raw_market': ['ItinID', 'MktID', 'MktCoupons', 'Year', 'Quarter', 'OriginAirportID', 'OriginAirportSeqID', 'OriginCityMarketID', 'Origin', 'OriginCountry', 'OriginStateFips', 'OriginState', 'OriginStateName', 'OriginWac', 'DestAirportID', 'DestAirportSeqID', 'DestCityMarketID', 'Dest', 'DestCountry', 'DestStateFips', 'DestState', 'DestStateName', 'DestWac', 'AirportGroup', 'WacGroup', 'TkCarrierChange', 'TkCarrierGroup', 'OpCarrierChange', 'OpCarrierGroup', 'RPCarrier', 'TkCarrier', 'OpCarrier', 'BulkFare', 'Passengers', 'MktFare', 'MktDistance', 'MktDistanceGroup', 'MktMilesFlown', 'NonStopMiles', 'ItinGeoType', 'MktGeoType', 'Unnamed: 41']}, {'raw_ticket': ['ItinID', 'Coupons', 'Year', 'Quarter', 'Origin', 'OriginAirportID', 'OriginAirportSeqID', 'OriginCityMarketID', 'OriginCountry', 'OriginStateFips', 'OriginState', 'OriginStateName', 'OriginWac', 'RoundTrip', 'OnLine', 'DollarCred', 'FarePerMile', 'RPCarrier', 'Passengers', 'ItinFare', 'BulkFare', 'Distance', 'DistanceGroup', 'MilesFlown', 'ItinGeoType', 'Unnamed: 25']}, {'ticket_prices': ['origin', 'dest', 'carrier', 'fare', 'fare_per_mile', 'passengers', 'distance']}, {'ticket_prices_by_route': ['origin', 'dest', 'carriers', 'fare', 'passengers', 'distance']}]]

      b. The request to the student is "Hard question. Requires use of subqueries and CASE WHEN.
We want to create groups of customers based on their total amount spent after discounts, in 2016. We will create three groups:

Low, for customers spending between 0 and 1000
Medium, for customers spending between 1000 and 5000,
High, for customers spending above 5000

The output should list the CustomerID, the CompanyName, the total amount spent before discounts, the total discount applied, and the grouping
You will need to use the results from the question &quot;Total amount spent per customer in 2016&quot; as a subquery, and then use the CASE WHEN structure to define the three groups. Do not worry about edge cases for the three groups (ie for amounts spent equal to 1000 and 5000)."

      c. The model answer is WITH total_spent AS (
SELECT C.CustomerID, C.CompanyName
    , COALESCE(SUM(D.Quantity * D.UnitPrice ),0) AS total_price
    , COALESCE(SUM(D.Quantity * D.UnitPrice * D.Discount ),0) AS total_discount
FROM
    Customers C
    LEFT JOIN Orders O ON C.CustomerID = O.CustomerID AND YEAR(O.OrderDate) = 2016
    LEFT JOIN OrderDetails D ON O.OrderID = D.OrderID
GROUP BY C.CustomerID
)
SELECT T.*,
    CASE
        WHEN T.total_price-T.total_discount BETWEEN 0 AND 1000 THEN &#39;Low&#39;
        WHEN T.total_price-T.total_discount BETWEEN 1000 AND 5000 THEN &#39;Medium&#39;
        WHEN T.total_price-T.total_discount &gt;= 5000 THEN &#39;High&#39;
    END AS TargetGroup
FROM total_spent T
ORDER BY T.total_price-T.total_discount (note that we may have multiple correct answers, the model answer is just an example)

      d. The student answer was use northwind;
SELECT
    c.CustomerID,
    c.CompanyName,
    t.total_spent AS total_spent_before_discount,
    t.total_discount,
    CASE
        WHEN t.total_spent >= 0 AND t.total_spent <= 1000 THEN 'Low'
        WHEN t.total_spent > 1000 AND t.total_spent <= 5000 THEN 'Medium'
        ELSE 'High'
    END AS customer_group
FROM
    Customers c
    JOIN (
        SELECT
            o.CustomerID,
            SUM(od.Quantity * od.UnitPrice) AS total_spent,
            SUM(od.Quantity * od.UnitPrice * od.Discount) AS total_discount
        FROM
            Orders o
            JOIN OrderDetails od ON o.OrderID = od.OrderID
        WHERE
            YEAR(o.OrderDate) = 2016
        GROUP BY
            o.CustomerID
    ) t ON c.CustomerID = t.CustomerID
ORDER BY
    c.CustomerID;


      e. Previously, students have submitted these answers and got back these responses and grades:
e0. submission: SELECT  O.CustomerID, C.CompanyName, ROUND(sum(quantity*unitPrice),2) AS TotalPayment, ROUND(sum(quantity*unitPrice*(1-Discount)),2) AS TotalPaymentPost, year(OrderDate) AS YearOrdered
FROM Orders O
LEFT JOIN OrderDetails D ON O.OrderID=D.OrderID
LEFT JOIN Customers C ON O.CustomerID=C.CustomerID
CASE WHEN TotalPaymentsPost <1000 THEN "LOW"
CASE WHEN TotalPaymentsPost >1000 AND <5000 THEN "Medium"
CASE WHEN TotalPaymentsPost >5000 THEN "High"
GROUP BY O.CustomerID, C.CompanyName, YearOrdered
Having YearOrdered = '2016'
ORDER BY CustomerID, TotalPayment DESC;, grade: 3.0/10.0, feedback: The feedback from the TA was WITH total_spent AS (
SELECT C.CustomerID, C.CompanyName
    , COALESCE(SUM(D.Quantity * D.UnitPrice ),0) AS total_price
    , COALESCE(SUM(D.Quantity * D.UnitPrice * D.Discount ),0) AS total_discount
FROM
    Customers C
    LEFT JOIN Orders O ON C.CustomerID = O.CustomerID AND YEAR(O.OrderDate) = 2016
    LEFT JOIN OrderDetails D ON O.OrderID = D.OrderID
GROUP BY C.CustomerID
)
SELECT T.*,
    CASE
        WHEN T.total_price-T.total_discount BETWEEN 0 AND 1000 THEN 'Low'
        WHEN T.total_price-T.total_discount BETWEEN 1000 AND 5000 THEN 'Medium'
        WHEN T.total_price-T.total_discount &gt;= 5000 THEN 'High'
    END AS TargetGroup
FROM total_spent T
ORDER BY T.total_price-T.total_discount asc;

e1. submission: SELECT S.CustomerID, S.CompanyName,P.TotalAmount AS TotalAmountSpent, P.DiscountApplied AS TotalDiscount,
    CASE
        WHEN P.TotalAmount < 1000 THEN 'Low'
        WHEN P.TotalAmount BETWEEN 1000 AND 5000 THEN 'Medium'
        WHEN P.TotalAmount > 5000 THEN 'High'
    END AS GROUP
FROM Customers S
INNER JOIN (SELECT CustomerID, SUM(TotalAmount) as TotalAmount, SUM(Discount) as DiscountApplied
    FROM Orders
    WHERE YEAR(OrderDate) = 2016
    GROUP BY CustomerID) P ON P.CustomerID = S.CustomerID;, grade: 7.0/10.0, feedback: The feedback from the TA was WITH total_spent AS (
SELECT C.CustomerID, C.CompanyName
    , COALESCE(SUM(D.Quantity * D.UnitPrice ),0) AS total_price
    , COALESCE(SUM(D.Quantity * D.UnitPrice * D.Discount ),0) AS total_discount
FROM
    Customers C
    LEFT JOIN Orders O ON C.CustomerID = O.CustomerID AND YEAR(O.OrderDate) = 2016
    LEFT JOIN OrderDetails D ON O.OrderID = D.OrderID
GROUP BY C.CustomerID
)
SELECT T.*,
    CASE
        WHEN T.total_price-T.total_discount BETWEEN 0 AND 1000 THEN 'Low'
        WHEN T.total_price-T.total_discount BETWEEN 1000 AND 5000 THEN 'Medium'
        WHEN T.total_price-T.total_discount &gt;= 5000 THEN 'High'
    END AS TargetGroup
FROM total_spent T
ORDER BY T.total_price-T.total_discount asc;

e2. submission: SELECT CustomerID, CompanyName, total_price, total_discount_applied,
	CASE
		WHEN total_after_discount > 5000 THEN 'High'
		WHEN total_after_discount <1000 THEN 'Low'
        ELSE 'Medium'
	END AS 'Grouping'
FROM (
SELECT C.CustomerID, C.CompanyName, SUM(UnitPrice*Quantity) AS total_price, SUM(UnitPrice*Quantity*Discount) AS total_discount_applied, SUM(UnitPrice*Quantity)-SUM(UnitPrice*Quantity*Discount) AS total_after_discount
FROM Customers C
LEFT JOIN Orders O ON C.CustomerID = O.CustomerID
LEFT JOIN OrderDetails OD ON O.OrderID = OD.OrderID
WHERE OrderDate LIKE '2016%'
GROUP BY C.CustomerID, C.CompanyName
ORDER BY C.CustomerID) A;, grade: 10.0/10.0, feedback: nan

e3. submission: DROP TABLE IF EXISTS Totalamtpercustomer;
Create Temporary Table Totalamtpercustomer As
Select c.CustomerID, c.CompanyName, sum((od.UnitPrice * od.Quantity)) as totalprice, sum((od.UnitPrice * od.Quantity * od.Discount)) as discount
from OrderDetails od
	join Orders o on od.OrderID = o.OrderID
    join Customers c on o.CustomerID = c.CustomerID
where year(orderDate) = 2016
group by c.CustomerID, c.CompanyName
order by c.CustomerID;

DROP TABLE IF EXISTS Finalamtpercustomer;
Create Temporary Table Finalamtpercustomer As
Select CustomerID, CompanyName, sum(totalprice - discount) as finalprice
from Totalamtpercustomer
Group by CustomerID, CompanyName
order by CustomerID;

Select *
CASE
	WHEN finalprice < 1000 then 'Low'
    When finalprice > 1000 and < 5000 then 'Medium'
    When finalprice > 5000 then 'High'
End as CustomerLevel
From Finalamtpercustomer;, grade: 5.0/10.0, feedback: nan

e4. submission: select Customers.CustomerID, Customers.CompanyName, sum(OrderDetails.Quantity * OrderDetails.UnitPrice) as TotalPrice, sum(OrderDetails.Quantity * OrderDetails.UnitPrice * Discount) as TotalDiscount, (sum(OrderDetails.Quantity * OrderDetails.UnitPrice) - sum(OrderDetails.Quantity * OrderDetails.UnitPrice * Discount)) as TotalAfterDiscounts
,case
    when TotalAfterDiscounts < 1000 then "Low"
    when TotalAfterDiscounts between 1000 and 5000
    else "High"
    End as Category
from Customers
left outer join Orders
on Customers.CustomerID = Orders.CustomerID
and year (Orders.OrderDate) = 2016
left outer join OrderDetails
on Orders.OrderID = OrderDetails.OrderID
left outer join Products
on OrderDetails.ProductID = Products.ProductID
group by Customers.CustomerID, Customers.CompanyName
order by CustomerID;, grade: 7.0/10.0, feedback: The feedback from the TA was WITH total_spent AS (
SELECT C.CustomerID, C.CompanyName
    , COALESCE(SUM(D.Quantity * D.UnitPrice ),0) AS total_price
    , COALESCE(SUM(D.Quantity * D.UnitPrice * D.Discount ),0) AS total_discount
FROM
    Customers C
    LEFT JOIN Orders O ON C.CustomerID = O.CustomerID AND YEAR(O.OrderDate) = 2016
    LEFT JOIN OrderDetails D ON O.OrderID = D.OrderID
GROUP BY C.CustomerID
)
SELECT T.*,
    CASE
        WHEN T.total_price-T.total_discount BETWEEN 0 AND 1000 THEN 'Low'
        WHEN T.total_price-T.total_discount BETWEEN 1000 AND 5000 THEN 'Medium'
        WHEN T.total_price-T.total_discount &gt;= 5000 THEN 'High'
    END AS TargetGroup
FROM total_spent T
ORDER BY T.total_price-T.total_discount asc;

e5. submission: #I couldn't get it to work but this is what I had with 1 minute left on the exam

SELECT O.CustomerID
	, C.CompanyName
	, SUM(D.UnitPrice*D.Quantity) AS totalPrice
	, SUM(D.UnitPrice*D.Quantity*D.Discount) AS totalDiscount
	, SUM(D.UnitPrice*D.Quantity*(1-D.Discount)) AS finalPrice
	, CASE WHEN finalPrice < 1000 THEN "LOW"
	, WHEN finalPrice >= 1000 AND < 5000 THEN "MEDIUM"
	, ELSE "HIGH"
FROM Orders O
	JOIN OrderDetails D ON O.OrderID = D.OrderID
	JOIN Customers C ON O.CustomerID = C.CustomerID
WHERE YEAR(OrderDate) = 2016
GROUP BY O.CustomerID
ORDER BY O.CustomerID;, grade: 9.0/10.0, feedback: nan

e6. submission: SELECT
    c.CustomerID,
    c.CompanyName,
    TotalAmountSpentBeforeDiscounts,
    TotalDiscountApplied,
    CASE
        WHEN TotalAmountSpentAfterDiscounts BETWEEN 0 AND 1000 THEN 'Low'
        WHEN TotalAmountSpentAfterDiscounts BETWEEN 1000 AND 5000 THEN 'Medium'
        ELSE 'High'
    END AS SpendingGroup
FROM
    Customers c
    LEFT JOIN (
        SELECT
            o.CustomerID,
            SUM(od.Quantity * od.UnitPrice) AS TotalAmountSpentBeforeDiscounts,
            SUM(od.Quantity * od.UnitPrice * od.Discount) AS TotalDiscountApplied,
            SUM(od.Quantity * od.UnitPrice * (1 - od.Discount)) AS TotalAmountSpentAfterDiscounts
        FROM
            Orders o
            INNER JOIN OrderDetails od ON o.OrderID = od.OrderID
        WHERE
            YEAR(o.OrderDate) = 2016
        GROUP BY
            o.CustomerID
    ) s ON c.CustomerID = s.CustomerID
ORDER BY
    c.CustomerID;, grade: 10.0/10.0, feedback: nan

e7. submission: SELECT CustomerID, CompanyName, SumOrderPrice, TotalDiscount,
    CASE
        WHEN SumOrderPrice - TotalDiscount BETWEEN 0 AND 1000 THEN 'Low'
        WHEN SumOrderPrice - TotalDiscount BETWEEN 1000 AND 5000 THEN 'Medium'
        WHEN SumOrderPrice - TotalDiscount > 5000 THEN 'High'
    END AS Grouping
FROM (
    SELECT Orders.CustomerID, Customers.CompanyName, SUM(OrderDetails.Quantity * OrderDetails.UnitPrice) AS TotalOrderPrice, SUM(OrderDetails.Quantity * OrderDetails.UnitPrice * OrderDetails.Discount) AS TotalDiscount
    FROM Orders
    JOIN Customers ON Orders.CustomerID = Customers.CustomerID
    JOIN OrderDetails ON Orders.OrderID = OrderDetails.OrderID
    WHERE YEAR(Orders.OrderDate) = 2016
    GROUP BY Orders.CustomerID, Customers.CompanyName
) AS CustomerData
ORDER BY CustomerID;, grade: 8.0/10.0, feedback: The feedback from the TA was WITH total_spent AS (
SELECT C.CustomerID, C.CompanyName
    , COALESCE(SUM(D.Quantity * D.UnitPrice ),0) AS total_price
    , COALESCE(SUM(D.Quantity * D.UnitPrice * D.Discount ),0) AS total_discount
FROM
    Customers C
    LEFT JOIN Orders O ON C.CustomerID = O.CustomerID AND YEAR(O.OrderDate) = 2016
    LEFT JOIN OrderDetails D ON O.OrderID = D.OrderID
GROUP BY C.CustomerID
)
SELECT T.*,
    CASE
        WHEN T.total_price-T.total_discount BETWEEN 0 AND 1000 THEN 'Low'
        WHEN T.total_price-T.total_discount BETWEEN 1000 AND 5000 THEN 'Medium'
        WHEN T.total_price-T.total_discount &gt;= 5000 THEN 'High'
    END AS TargetGroup
FROM total_spent T
ORDER BY T.total_price-T.total_discount asc;

e8. submission: WITH CustomerSpendIn2016 AS (
    SELECT
        C.CustomerID,
        C.CompanyName,
        IFNULL(
            SUM(D.Quantity * D.UnitPrice),
            0
        ) AS total_price,
        IFNULL(
            SUM(D.Quantity * D.UnitPrice * D.Discount),
            0
        ) AS total_discount
    FROM Customers C
        LEFT JOIN Orders O
            ON C.CustomerID = O.CustomerID
            AND YEAR(OrderDate) = 2016
        LEFT JOIN OrderDetails D
            ON O.OrderID = D.OrderID
    GROUP BY C.CustomerID
    ORDER BY C.CustomerID
)
SELECT
    CS.*,
    (CASE
        WHEN (CS.total_price - CS.total_discount) BETWEEN 0 AND 1000
            THEN 'Low'
        WHEN (CS.total_price - CS.total_discount) BETWEEN 1000 AND 5000
            THEN 'Medium'
        WHEN (CS.total_price - CS.total_discount) > 5000
            THEN 'High'
        END
    ) AS spend_group
FROM CustomerSpendIn2016 CS;, grade: 10.0/10.0, feedback: nan

e9. submission: use northwind;

SELECT t.CustomerID, t.CompanyName, t.total_price, t.total_discount, t.total_price - t.total_discount AS total_after_discount,
    CASE
        WHEN t.total_price - t.total_discount BETWEEN 0 AND 1000 THEN 'Low'
        WHEN t.total_price - t.total_discount BETWEEN 1000 AND 5000 THEN 'Medium'
        ELSE 'High'
    END AS customer_group
FROM
    (SELECT c.CustomerID, c.CompanyName, SUM(od.Quantity * od.UnitPrice) AS total_price, SUM(od.Quantity * od.UnitPrice * od.Discount) AS total_discount FROM  Customers c
LEFT OUTER JOIN Orders o ON c.CustomerID = o.CustomerID AND YEAR(o.OrderDate) = 2016 LEFT OUTER JOIN OrderDetails od ON o.OrderID = od.OrderID
GROUP BY c.CustomerID, c.CompanyName
    ) AS t
ORDER BY t.CustomerID;, grade: 8.0/10.0, feedback: nan

e10. submission: SELECT CustomerID, CompanyName, TotalPrice, TotalDiscount,
  CASE
    WHEN TotalPrice - TotalDiscount <= 1000 THEN 'Low'
    WHEN TotalPrice - TotalDiscount <= 5000 THEN 'Medium'
    ELSE 'High'
    End
FROM (
  SELECT O.orderDate, C.CustomerID, C.CompanyName, SUM(OD.Quantity*OD.UnitPrice) AS TotalPrice, SUM(OD.Quantity*OD.UnitPrice*OD.Discount) AS TotalDiscount
FROM Customers C
INNER JOIN Orders O
ON C.CustomerID = O.CustomerID
INNER JOIN OrderDetails OD
ON O.OrderID = OD.OrderID
WHERE YEAR(O.OrderDate) = 2016
GROUP BY O.orderDate, C.CustomerID, C.CompanyName
ORDER BY C.CustomerID;
) T;, grade: 5.0/10.0, feedback: nan

e11. submission: DROP TABLE IF EXISTS ' 2016Spend';
CREATE TEMPORARY TABLE '2016Spend'
USE northwind ;
SELECT O.CustomerID
	, S.CompanyName
	, O.OrderID
	, D.Quantity*D.UnitPrice AS OrderPrice
    ,D.Quantity*D.UnitPrice*D.Discount AS withDiscount
FROM Orders O
	LEFT JOIN Customers C ON O.CustomerID = C.CustomerID
    LEFT JOIN Shippers S ON O.ShipVia = S.ShipperID
    LEFT JOIN OrderDetails D ON D.OrderID = O.OrderID
WHERE OrderDate LIKE '2016%'
GROUP BY CustomerID, OrderID,  D.Quantity , D.UnitPrice, D.Discount
ORDER BY O.CustomerID
;
, grade: 5.0/10.0, feedback: The feedback from the TA was WITH total_spent AS (
SELECT C.CustomerID, C.CompanyName
    , COALESCE(SUM(D.Quantity * D.UnitPrice ),0) AS total_price
    , COALESCE(SUM(D.Quantity * D.UnitPrice * D.Discount ),0) AS total_discount
FROM
    Customers C
    LEFT JOIN Orders O ON C.CustomerID = O.CustomerID AND YEAR(O.OrderDate) = 2016
    LEFT JOIN OrderDetails D ON O.OrderID = D.OrderID
GROUP BY C.CustomerID
)
SELECT T.*,
    CASE
        WHEN T.total_price-T.total_discount BETWEEN 0 AND 1000 THEN 'Low'
        WHEN T.total_price-T.total_discount BETWEEN 1000 AND 5000 THEN 'Medium'
        WHEN T.total_price-T.total_discount &gt;= 5000 THEN 'High'
    END AS TargetGroup
FROM total_spent T
ORDER BY T.total_price-T.total_discount asc;

e12. submission: SET @total_price = (SELECT SUM(D.Quantity*D.UnitPrice) FROM OrderDetails D);
SET @total_discount = (SELECT SUM(D.Quantity*D.UnitPrice*D.Discount) FROM OrderDetails D);
SET @total_after_discount = (SELECT (SUM(D.Quantity*D.UnitPrice)-SUM(D.Quantity*D.UnitPrice*D.Discount)) FROM OrderDetails D);

SELECT O.CustomerID
		, C.CompanyName
        , @total_price
        , @total_discount
        , @total_after_discount
		,CASE
		WHEN @total_after_discount BETWEEN 0 AND 1000 THEN "LOW"
        WHEN @total_after_discount BETWEEN 1000 AND 5000 THEN "MEDIUM"
        WHEN @total_after_discount > 5000 THEN "HIGH"
        ELSE "NONE"
	END AS Grouping
FROM Orders O
	INNER JOIN Customers C ON C.CustomerID = O.CustomerID
    INNER JOIN OrderDetails D ON D.OrderID = O.OrderID
WHERE O.OrderDate BETWEEN "2016-01-01 00:00:00" AND "2016-12-31 11:59:59"
GROUP BY O.CustomerID, C.CompanyName
ORDER BY O.CustomerID;, grade: 8.0/10.0, feedback: The feedback from the TA was WITH total_spent AS (
SELECT C.CustomerID, C.CompanyName
    , COALESCE(SUM(D.Quantity * D.UnitPrice ),0) AS total_price
    , COALESCE(SUM(D.Quantity * D.UnitPrice * D.Discount ),0) AS total_discount
FROM
    Customers C
    LEFT JOIN Orders O ON C.CustomerID = O.CustomerID AND YEAR(O.OrderDate) = 2016
    LEFT JOIN OrderDetails D ON O.OrderID = D.OrderID
GROUP BY C.CustomerID
)
SELECT T.*,
    CASE
        WHEN T.total_price-T.total_discount BETWEEN 0 AND 1000 THEN 'Low'
        WHEN T.total_price-T.total_discount BETWEEN 1000 AND 5000 THEN 'Medium'
        WHEN T.total_price-T.total_discount &gt;= 5000 THEN 'High'
    END AS TargetGroup
FROM total_spent T
ORDER BY T.total_price-T.total_discount asc;

e13. submission: SELECT CustomerID, CompanyName, TotalPrice, TotalDiscount, TotalPrice - TotalDiscount AS Total_After_Discount,
CASE
	WHEN TotalPrice - TotalDiscount > 5000 THEN 'High'
	WHEN TotalPrice - TotalDiscount > 1000 THEN 'Medium'
	ELSE 'Low'
END AS 'Group'

In [22]:
# select a specific question and control submission size
df = data[data['QuestionId']=='5,168,443']

df0 = generate_mega_prompt(df, 0)
df0.head()

<ipython-input-18-d78b26898815>:47: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  mega_df = mega_df.append(new_row, ignore_index=True)

  QuestionId                                         MegaPrompt
0  5,168,443  \n      a. We are working with the flights dat...

In [23]:
df5 = generate_mega_prompt(df, 5)
df10 = generate_mega_prompt(df, 10)
df20 = generate_mega_prompt(df, 20)
df_all = generate_mega_prompt(df, len(df))

<ipython-input-18-d78b26898815>:47: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  mega_df = mega_df.append(new_row, ignore_index=True)
<ipython-input-18-d78b26898815>:47: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  mega_df = mega_df.append(new_row, ignore_index=True)
<ipython-input-18-d78b26898815>:47: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  mega_df = mega_df.append(new_row, ignore_index=True)
<ipython-input-18-d78b26898815>:47: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  mega_df = mega_df.append(new_row, ignore_index=True)

## GPT4

In [43]:
openai.api_key = "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"

In [44]:
def GPT4_generation(prompt):
  response = openai.ChatCompletion.create(
    model="gpt-4-32k",
    messages=[{"role": "user", "content": prompt}],
    n = 1,
    stream = False,
    temperature=0.0,
    max_tokens=600,
    top_p = 1.0,
    frequency_penalty=0.0,
    presence_penalty=0.0
    # stop = ["Q:"]
  )
  return response['choices'][0]['message']['content']

In [45]:
print(GPT4_generation(df0.loc[0,'MegaPrompt']))

Grade: 9/10

Feedback: Your answer is almost perfect. You have correctly used the RANK() function to calculate the national and state rank. However, you have used 'total_airport_passengers' instead of 'total_passengers' as in the model answer. Please make sure to use the correct column names. Otherwise, your SQL syntax and join operation are correct. Good job!

In [46]:
print(GPT4_generation(df5.loc[0,'MegaPrompt']))

The student's answer is correct. They have correctly used the RANK() function to calculate the national and state ranks based on the total number of passengers. They have also correctly joined the m_airports table to get the state of each airport.

Grade: 4.0/4.0

Feedback: Great job! You have correctly used the RANK() function to calculate the national and state ranks. Your join operation is also correct. Keep up the good work!

In [47]:
print(GPT4_generation(df10.loc[0,'MegaPrompt']))

Grade: 4.0/4.0

Feedback: Your answer is correct. You have successfully used the RANK() function to calculate the national and state rank of each airport based on the number of departing passengers. Your join operation is also correct, linking the 'origin' field in the 'passengers_per_airport' table with the 'airport' field in the 'm_airports' table. Good job!

In [48]:
print(GPT4_generation(df20.loc[0,'MegaPrompt']))

The student's answer is correct. They have correctly used the RANK() function to calculate the national and state rank of each airport based on the number of departing passengers. They have also correctly joined the m_airports table to get the state of each airport.

Grade: 4.0/4.0

Feedback: Great job! You have correctly used the RANK() function and joined the necessary tables to get the desired output. Keep up the good work!

In [49]:
print(GPT4_generation(df_all.loc[0,'MegaPrompt']))

The student's answer is correct. They have correctly used the RANK() function to calculate the national and state rank of each airport based on the number of departing passengers. They have also correctly joined the passengers_per_airport and m_airports tables on the 'origin' and 'airport' columns respectively.

Grade: 4.0/4.0

Feedback: Great job! You have correctly used the RANK() function to calculate the national and state rank of each airport based on the number of departing passengers. Your join operation is also correct. Keep up the good work!

In [35]:
def test_shots(qid, n):
  df = data[data['QuestionId']==qid]
  df_n = generate_mega_prompt(df, n)
  # df_n.head()
  print(f'{n} submissions:')
  print(GPT4_generation(df_n.loc[0,'MegaPrompt']))

In [36]:
for i in range(0, 21, 5):
  test_shots('5,168,443', i)

<ipython-input-18-d78b26898815>:47: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  mega_df = mega_df.append(new_row, ignore_index=True)

0 submissions:
The student's answer is correct. The student correctly used the RANK() function to calculate the national and state ranks. The student also correctly joined the passengers_per_airport and m_airports tables on the airport column. The only difference between the student's answer and the model answer is the naming of the columns, but this does not affect the correctness of the answer.

Grade: 10/10

Feedback: Great job! You correctly used the RANK() function and joined the tables correctly. Keep up the good work!
5 submissions:

<ipython-input-18-d78b26898815>:47: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  mega_df = mega_df.append(new_row, ignore_index=True)

The student's answer is correct. They have correctly used the RANK() function to calculate the national and state ranks based on the total number of passengers. They have also correctly joined the m_airports table to get the state of each airport.

Grade: 4.0/4.0

Feedback: Great job! You have correctly used the RANK() function to calculate the national and state ranks. Your join operation is also correct. Keep up the good work!
10 submissions:

<ipython-input-18-d78b26898815>:47: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  mega_df = mega_df.append(new_row, ignore_index=True)

The student's answer is correct. They have correctly used the RANK() function to calculate the national and state rank of each airport based on the number of departing passengers. They have also correctly joined the passengers_per_airport and m_airports tables on the airport column.

Grade: 4.0/4.0

Feedback: Great job! You have correctly used the RANK() function and joined the tables correctly. Keep up the good work!
15 submissions:

<ipython-input-18-d78b26898815>:47: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  mega_df = mega_df.append(new_row, ignore_index=True)

Grade: 4.0/4.0

Feedback: Your SQL query is correct. You have successfully calculated the national and state rank for each airport based on the number of departing passengers. Good job on using the RANK() function and joining the tables correctly. Keep up the good work!
20 submissions:

<ipython-input-18-d78b26898815>:47: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  mega_df = mega_df.append(new_row, ignore_index=True)

The student's answer is correct. They have correctly used the RANK() function to calculate the national and state rank of each airport based on the number of departing passengers. They have also correctly joined the m_airports table to get the state of each airport.

Grade: 4.0/4.0

Feedback: Great job! You have correctly used the RANK() function and joined the necessary tables to get the desired output. Keep up the good work!

In [37]:
mega_df_all.shape
mega_df_all.head(20)

   QuestionId                                         MegaPrompt
0   4,969,729  \n      a. We are working with the ['northwind...
1   4,969,713  \n      a. We are working with the ['northwind...
2   4,969,711  \n      a. We are working with the ['northwind...
3   4,969,710  \n      a. We are working with the ['northwind...
4   4,969,709  \n      a. We are working with the ['northwind...
5   4,969,708  \n      a. We are working with the ['northwind...
6   4,969,707  \n      a. We are working with the ['northwind...
7   4,969,706  \n      a. We are working with the ['northwind...
8   4,969,705  \n      a. We are working with the ['northwind...
9   5,119,646  \n      a. We are working with the music datab...
10  4,969,714  \n      a. We are working with the ['northwind...
11  4,956,678  \n      a. We are working with the ['northwind...
12  4,956,293  \n      a. We are working with the ['northwind...
13  4,338,658  \n      a. We are working with the ['northwind...
14  5,168,443  \n      a. We are working with the flights dat...
15  5,168,442  \n      a. We are working with the flights dat...
16  5,168,441  \n      a. We are working with the flights dat...
17  5,168,440  \n      a. We are working with the flights dat...
18  5,168,439  \n      a. We are working with the flights dat...
19  5,168,438  \n      a. We are working with the flights dat...

In [51]:
mega_df_all.shape

(56, 2)

In [53]:
from tqdm import tqdm

In [54]:
for i, p in tqdm(mega_df_all.iterrows()):
  # print(i, len(p['MegaPrompt'].split()))
  p['feedback'] = GPT4_generation(p['MegaPrompt'])

mega_df_all.head()

56it [04:14,  4.55s/it]

  QuestionId                                         MegaPrompt
0  4,969,729  \n      a. We are working with the ['northwind...
1  4,969,713  \n      a. We are working with the ['northwind...
2  4,969,711  \n      a. We are working with the ['northwind...
3  4,969,710  \n      a. We are working with the ['northwind...
4  4,969,709  \n      a. We are working with the ['northwind...

In [ ]:
mega_df_all['feedback'] = mega_df_all['MegaPrompt'].apply(GPT4_generation)
mega_df_all.head()